trunk/data/WLM Data/Full Login/login.xml

https://login.live.com/RST.srf

POST /RST.srf HTTP/1.1
Accept: text/*
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; InfoPath.2; .NET CLR 2.0.50727; IDCRL 4.100.313.1; IDCRL-cfg 4.0.5633.0; App msnmsgr.exe, 8.1.178.0, {7108E71A-9926-4FCB-BCC9-9A9D3F32E423})
Host: login.live.com
Content-Length: 3529
Connection: Keep-Alive
Cache-Control: no-cache
Cookie: MSPPre=kopetesoc@hotmail.com; MSPCID=0c04e30c44987020; ANON=A=E981AF61EB22071F32974F98FFFFFFFF&E=58d&W=3; NAP=V=1.5&E=533&C=-5lWqBlj735-zDU1p3HRafxiiNoSjhAnAHD9Vnvy3-R1l1TOPQ4XcA&W=3; MUID=6E2C79F7796C45D592040F17AB4B6869

<?xml version="1.0" encoding="UTF-8"?><Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc" xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust">
  <Header>
    <ps:AuthInfo xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="PPAuthInfo">
      <ps:HostingApp>{7108E71A-9926-4FCB-BCC9-9A9D3F32E423}</ps:HostingApp>
      <ps:BinaryVersion>4</ps:BinaryVersion>
      <ps:UIVersion>1</ps:UIVersion>
      <ps:Cookies></ps:Cookies>
      <ps:RequestParams>AQAAAAIAAABsYwQAAAAyMDUy</ps:RequestParams>
    </ps:AuthInfo>
    <wsse:Security>
      <wsse:UsernameToken Id="user">
        <wsse:Username>kopetesoc@hotmail.com</wsse:Username>
        <wsse:Password>soc2007</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </Header>
  <Body>
    <ps:RequestMultipleSecurityTokens xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="RSTS">
      <wst:RequestSecurityToken Id="RST0">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>http://Passport.NET/tb</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST1">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>messengerclear.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="MBI_KEY_OLD"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST2">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>messenger.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="?id=507"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST3">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>contacts.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="MBI"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST4">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>messengersecure.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="MBI_SSL"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST5">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>spaces.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="MBI"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
      <wst:RequestSecurityToken Id="RST6">
        <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
        <wsp:AppliesTo>
          <wsa:EndpointReference>
            <wsa:Address>storage.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wsse:PolicyReference URI="MBI"></wsse:PolicyReference>
      </wst:RequestSecurityToken>
    </ps:RequestMultipleSecurityTokens>
  </Body>
</Envelope>
=================================================
HTTP/1.1 200 OK
Connection: close
Date: Thu, 07 Jun 2007 17:44:59 GMT
Server: Microsoft-IIS/6.0
PPServer: PPV: 30 H: BAYPPLOGN2B65 V: 0
X-Powered-By: ASP.NET
Content-Type: text/html; charset=iso-8859-1
Expires: Thu, 07 Jun 2007 17:43:59 GMT
Cache-Control: no-cache
Pragma: no-cache
P3P: CP="DSP CUR OTPi IND OTRi ONL FIN"
Content-Length: 11904

<?xml version="1.0" encoding="utf-8" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <psf:pp xmlns:psf="http://schemas.microsoft.com/Passport/SoapServices/SOAPFault">
      <psf:serverVersion>1</psf:serverVersion>
      <psf:PUID>00067FFE9D9B9004</psf:PUID>
      <psf:configVersion>3.100.2199.0</psf:configVersion>
      <psf:uiVersion>3.0.869.0</psf:uiVersion>
      <psf:authstate>0x48803</psf:authstate>
      <psf:reqstatus>0x0</psf:reqstatus>
      <psf:serverInfo Path="Live1" RollingUpgradeState="ExclusiveNew" LocVersion="0" ServerTime="2007-06-07T17:44:59Z">BAYPPLOGN2B65 2007.04.23.14.59.31</psf:serverInfo>
      <psf:cookies/>
      <psf:browserCookies>
        <psf:browserCookie Name="MH" URL="http://www.msn.com">MH=; path=/; domain=.msn.com; expires=Wed, 30-Dec-2037 16:00:00 GMT</psf:browserCookie>
        <psf:browserCookie Name="MHW" URL="http://www.msn.com">MHW=; path=/; domain=.msn.com; expires=Thu, 30-Oct-1980 16:00:00 GMT</psf:browserCookie>
        <psf:browserCookie Name="MH" URL="http://www.live.com">MH=; path=/; domain=.live.com; expires=Wed, 30-Dec-2037 16:00:00 GMT</psf:browserCookie>
        <psf:browserCookie Name="MHW" URL="http://www.live.com">MHW=; path=/; domain=.live.com; expires=Thu, 30-Oct-1980 16:00:00 GMT</psf:browserCookie>
      </psf:browserCookies>
      <psf:credProperties>
        <psf:credProperty Name="MainBrandID"></psf:credProperty>
        <psf:credProperty Name="BrandIDList"></psf:credProperty>
        <psf:credProperty Name="IsWinLiveUser">true</psf:credProperty>
        <psf:credProperty Name="CID">0c04e30c44987020</psf:credProperty>
      </psf:credProperties>
      <psf:extProperties></psf:extProperties>
      <psf:response/>
    </psf:pp>
  </S:Header>
  <S:Body>
    <wst:RequestSecurityTokenResponseCollection xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust" xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:psf="http://schemas.microsoft.com/Passport/SoapServices/SOAPFault">
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:legacy</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>http://Passport.NET/tb</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T17:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Id="BinaryDAToken0" Type="http://www.w3.org/2001/04/xmlenc#Element">
            <EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"></EncryptionMethod>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
              <ds:KeyName>http://Passport.NET/STS</ds:KeyName>
            </ds:KeyInfo>
            <CipherData>
              <CipherValue>Ae7IWP3Wxnju8HhMJtg+HINlEM72Pd15CjwuI2xFZjgYQISNAkO7EoVBJAJPvYiZbOOc4loLCFyEa6e4yRj90c9e4iJy8oCAUcKnH8DL9E+rXQWcmztTc5e9+Em2WEvoV3kBwpEijTF2UBhXbb2BHSGc8kFX9x8tFc5cnAF+R6kooZ8V5O/rAZ6DcpWvxeu6lYGDFjmPjWzBjvf6x5IV/BCP/oE5lmSnIJ9vziWiTLgF9i8yjmCZoBBeJ2WynlAaLpcDjefhqbfUUg8TI5oXOWxfhD3ssYS+S35LWdCN/URIKKlhmz1fc293esd1yfWTydURXLpzIgN8kIqCGcGgSOiw/Zv+NkUVXA+LyX/pK3GHFtanIaTUcqAUD5ZaNL4Q8JSqOrEcVGmEtwjnNRFcQc1Eke+KIFlfNSfqD+BFKcjgWkbdRbMLLE6AxGhRY8R8BzZWxeQ=</CipherValue>
            </CipherData>
          </EncryptedData>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport"></wsse:KeyIdentifier>
          <wsse:Reference URI="#BinaryDAToken0"></wsse:Reference>
        </wst:RequestedTokenReference>
        <wst:RequestedProofToken>
          <wst:BinarySecret>pCZGraixAOgNmOYuEwFLwEynNdvshd+o</wst:BinarySecret>
        </wst:RequestedProofToken>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:compact</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>messengerclear.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T01:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="Compact1">t=EwBQAswbAQAUs1/VcBU2sH7mwYy3BysWZ71CRDGAAJNFmE0TrHWxMkO15G1f79Ipw1x6tJLx3DVTJDg0ss3UxWDZh9IzlOqe7/4jBnq+VhCkopTP4e+XCEKkN3Ai91urxdIz9J1/swpojN2LuLLlWrFBNi4jRmW1xqT6vpwU09IHgVGOjWg+4Xv1G6iQOsAPayRM31DRv0NBXH/nSkJmA2YAAAivNj4QYvMUzqABbxIaB3r+DCjVyWlq5xwi/tl4/Km2ix+OQU5j7mGnfJf3ihBayve9y+W89CqKDHSq+ms7lm2OnkPFZM+4CXaycBDSnpVR/YAvPjTo5dnBaIt7O8riD/jWaAZUtnTpbIERX5RQckbN673LffshqkaiDGm2/ndVizeDakxqYhDTO50DdgGxLYgIcsdgM100yUbL+nrKvZeHs0rL4a1hKqjwrc4+TeF78az1MCIVb9AHWjnlvS/1sES5Q6FWx7e36nVThPCWdFcjH6AWiROrDcuQtPp1GHkl8SspHpoOuwqixWiJuJ8gIW6OGuzK0NSzaJBH6ZJVBU0z064dzz/v0dRRDLUhcADFFcFr0ZqoaYsZ/Z6q9N1nc7HhYSDmmcf0PhwU5PmomlDsXX3tH5eASu6PkT0KQycrdXXmHTyIpQiKytyYnTlrRkYAikWyd3bMpTWQcRq6eohmHJFl5+nmVa+KEPgNaZETOTH4lH5LSWcPv2AJ6kTEpKOlAW+aXLjkLbjhzfgs5oT58DTPaBAmqvCXiZGg7/Zt78IaxW7p4xNMjguwAQ==&amp;p=</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport:compact"></wsse:KeyIdentifier>
          <wsse:Reference URI="#Compact1"></wsse:Reference>
        </wst:RequestedTokenReference>
        <wst:RequestedProofToken>
          <wst:BinarySecret>8syEDGFpaD4TJLjh0oQnQbXI8czOnKJQ</wst:BinarySecret>
        </wst:RequestedProofToken>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:legacy</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>messenger.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-07T17:53:19Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="PPToken2">t=9NeMXGbz0ERi9jQ3vg*9*PlpDddjbz1vQ0Rb9BzxOgXLa*FF6T7GVpjKOTEhxfpJ5nsCy!HA!Ki6rJM1gOTYRH7GPvGw2lmsRIDjxh!!3JYzU*SCEnoVzgrXxHox7gRaCE&amp;p=9!mVqylhfGoNZ*RzSUOcN6r!KSqJi2EPt6MfnnUt27X7IL0GBJ9Gzlqak6bPphtEsVOTdtPQw58xIS3AlDVazkb24Vo6HP721GW68Fp252QG9GiN!KCL*WH3BtoJospzzMyXKnQAbPrMwV15qClCeIrbpPQ*JsIqXy1e*MTtP7Oc8GJ4jTe1zEVGFinu1sBrao</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport"></wsse:KeyIdentifier>
          <wsse:Reference URI="#PPToken2"></wsse:Reference>
        </wst:RequestedTokenReference>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:compact</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>contacts.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T01:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="Compact3">t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AACew9ABFVGaeqeAlfNvbF6YT/OdKwLUyxGarq/yhjJPpF4tA276y46WLReFrChN6/CEU31akhJ1tAuM2Fni9XEaMGVVA7jlW1dmDVMa3bMikxS+nsUoY4vYCsSgnbMxDIMeuLmDsm/zV5frFKVU+ysItr+5XDBAv6vJDx0eysW9CA2YAAAhiV61UfqJ2SBgBQ+RoEReNgU+pvGoPtjraJlXQMfhsELqueLs598z1V2PEZUUB88Vtkbb6dIRgM4c16IlrNm8RQkd8iz5i8EmCrn/7FCEscbp84v2X+6a4sqd29f7PWd54ZztxHhAJPIuJ6ZtciEp0U3lu20jW9JCq4LH6ydxGD1Hyo0FHk8kLWEjvDylQCmcLIIHDFHOQOsYa7LtsSytMen5pG3EpQCxDjmyBtjyFz7PIHm3ZOApetTjCLAVSb5LrNjadGlyWzJdwPQP7uR6tg2GoqrYzbgMkMwp0gudoCSAagAyM6QhmGy3Agwfd2yKJW/K7O/CRbqF0GaVunIS4laI1aT/M82NP2atntRL8m6+3kqupjMyTvb2oOG12sf7tSTAB&amp;p=</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport:compact"></wsse:KeyIdentifier>
          <wsse:Reference URI="#Compact3"></wsse:Reference>
        </wst:RequestedTokenReference>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:compact</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>messengersecure.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T17:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="Compact4">t=EwDIATIiAQAUno9QpucDnNi8T5syqJTstzjjm3WAADmVoxHMEogyUHQjF9M3KdKCioELQF2F8cZUOWP256N/tEkHbC08SHtWvgCxAkdQaVlgjOy0w6MoHpC9KuKSXiS9VIWiaCUjCqTivnphlxe6JgP40ZpxHClN63ehdcvnXkdtWraJQOxxeIlW0qhhN7KHwFfeubWcY+NQfNIVulucA2YAAAjS7xefN7gCBBgB1x7Eq8AGQWKAXLSWVe6IV5Wmfqko7okkaCPwIscJKEOiywEeopgYDYY79TbdyPdKT542Hhfrp/x4dHj+r8thcyr2izO/iefH9z1WM45/+U+0CzzPiKIo5xiT1sXpUDQOZRd5YWcfLBJNLu8n0O/VRC9w3Wcu42IpfuvdbnBgf7FUyYa1iv7C/g9w3f4IpIk2VjFNiGYNZmeLCGTXty78TWp/oZEoVtNMXon8d2cNi3OXuUQM+1wZO7ghFzyFdvi6Y8CWdxK+YxYjkxDuGu3jWMN5H5nXCxxyMxF1xezH+b2gyFK424pmwct5jj9IbV/WH38Tz1UR8xRqBSDqgSl3CCt4Rd8z125Od5keiw/D28MxCXrbvxf7bTAB&amp;p=</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport:compact"></wsse:KeyIdentifier>
          <wsse:Reference URI="#Compact4"></wsse:Reference>
        </wst:RequestedTokenReference>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:compact</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>spaces.live.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T01:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="Compact5">t=EwDIARAnAAAURATre1Nkcu71L953y0QRAvwyKdOAAAlq5FJAVwGJU8hfyiqg9YKcOLIsceyeY1COSKnKS8Rj5sCkBb01A3LmVVc3h4SPYcBAXpwl2uw+3djnYSO2avQcS7MhHKkQVRg29fzSG8J/zP+rTWdR0kPHkKZeTjwZLcEH7//8oy2zx6EKHnIWiJRTTAKo0a5dUFoJvd6Eq2JnA2YAAAjXgpUNX6XovRgBjkLOAXeEVn6oeJHcYqfwtMmwixJbsJF6noqF85KQDYNRuwMttVwdcT67Py+Dlx1i1EGXvy6qyDlmfbbR3ih2DRByhfMPZyeRK2r3Y+s/P3O60lu12+0H6T4RvMSSvsegc+sQ5arEQGN0FL5CuDOwjtM2w/vgPhwmUjublhrDrpE5OGQ+84oYZqxtPSgS3EcRbY712Pjo3XmJ4d2x1+Z+/K3Md6loAaIyj4q6/gzeHXFOmOfYGI0Hkc++9JDaQmQiUHBELF51w1PolGCsIMEHNGxMLxuMwqC4N7QLg+8icYzzlS8iwXHMOVGxHlQUfkBAz0ILUmmfX/HoTMwFyZwTt6oM/QwVQACjjZMhg7DrovphiqRUM+gjwDAB&amp;p=</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport:compact"></wsse:KeyIdentifier>
          <wsse:Reference URI="#Compact5"></wsse:Reference>
        </wst:RequestedTokenReference>
      </wst:RequestSecurityTokenResponse>
      <wst:RequestSecurityTokenResponse>
        <wst:TokenType>urn:passport:compact</wst:TokenType>
        <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
          <wsa:EndpointReference>
            <wsa:Address>storage.msn.com</wsa:Address>
          </wsa:EndpointReference>
        </wsp:AppliesTo>
        <wst:LifeTime>
          <wsu:Created>2007-06-07T17:44:59Z</wsu:Created>
          <wsu:Expires>2007-06-08T01:44:59Z</wsu:Expires>
        </wst:LifeTime>
        <wst:RequestedSecurityToken>
          <wsse:BinarySecurityToken Id="Compact6">t=EwDIAW+jAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AAFZAjQFFyN9GD36eo1zGSdxAIdjzsqC4TH6cqXxTjJ6dS72yCh2N+3qHNCrh61P069Sd4OarPZyGgsO5cq8uy8pz01lLPHV/ZTf0SHaHOcsRi2DFqbjWiM8PwQ/MERMurC5bcK9pp4Tpy4hAC6Db1yo/h9en9C2EXZaPhuTVjD58A2YAAAix/ngb7hOZ2xgBoYOT3RqFI7oxhVPoVqS+vPH6sHr5xeF5R9RLUlQ2E6m+AKCeHF5S9Oo6DtkFuan63JN9yQuskBEY2OgfdDL0ZOgPzZHMGymVBV1KxSTgGgqqczb+8UI/Kwu4HBSKQBwkeJ6oQbp8u5c5lOHW20LunWU966avKUgXLrk6izKrzKhzp1nzCyoINubIknMx4cZrVOKRgeeQyvrGLBDvKAFIvRzyqlqPwRDJJbnMAXPr/u/jqLFA3NtvczPufzP/JgWI82cQr9SAjS1tj4rjLohsRGCNmgbK8uOiWkaUOV900aG0fOjIlgOinMECpOHkdMroniEd9Hx9rVLlty5nBLbq8LEM65gMwxjAkZ2TVmyJP59sd4XGb/xDLzAB&amp;p=</wsse:BinarySecurityToken>
        </wst:RequestedSecurityToken>
        <wst:RequestedTokenReference>
          <wsse:KeyIdentifier ValueType="urn:passport:compact"></wsse:KeyIdentifier>
          <wsse:Reference URI="#Compact6"></wsse:Reference>
        </wst:RequestedTokenReference>
      </wst:RequestSecurityTokenResponse>
    </wst:RequestSecurityTokenResponseCollection>
  </S:Body>
</S:Envelope>